app/views/books/show.html.erb

SELECT "borrowships".* FROM "borrowships"  WHERE "borrowships"."book_id" = ?  ORDER BY created_at desc  [["book_id", 3]]
---
          <div class="title">History</div>
          <% @book.borrowships.each do |bs| %>