app/controllers/books_controller.rb

SELECT "books".* FROM "books"  WHERE "books"."available" = 't'  ORDER BY updated_at desc
---
  def index
    @books = Book.where(available: true) + Book.where(available: false)

SELECT  "books".* FROM "books"  WHERE "books"."id" = 2  ORDER BY updated_at desc LIMIT 1
---
  def show
    @book = Book.find_by(id: params[:id])

SELECT  "books".* FROM "books"  WHERE "books"."id" = 2  ORDER BY updated_at desc LIMIT 1
INSERT INTO "borrowers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-24 02:55:11.362297"], ["name", "winter"], ["updated_at", "2014-12-24 02:55:11.362297"]]
SELECT  "borrowers".* FROM "borrowers"  WHERE "borrowers"."name" = 'winter' LIMIT 1
---
  def update
    @book = Book.find_by(id: params[:id])

    if params[:return]
      @book.returned
      redirect_to root_path
    else
      @name = params[:name].strip
      if @name and @name != ""
        borrower = Borrower.find_or_create_by(name: @name)